frank26080115/robots/Roach/libraries/nRF52BlHeliPassthru/nRF52BlHeliPassthru.cpp
#include "nRF52BlHeliPassthru.h"
#include "nRF52BlHeliPassthru_consts.h"
#include <Arduino.h>

#define NRFBHPT_SER_BUFF_SIZE 512

static uint32_t last_avail = 0;
static uint32_t last_ser_time = 0;
static bool     serial_command = false;
static uint8_t  serial_rx[NRFBHPT_SER_BUFF_SIZE];
static uint16_t serial_rx_counter = 0;
static uint16_t serial_tx_counter = 0;
static uint16_t serial_buffer_len = 0;
static uint16_t esc_crc = 0;
static bool     enable4way = true;

uint16_t nrfbhpt_4way(uint8_t buf[]);
uint16_t nrfbhpt_msp(uint8_t buf[], uint8_t buf_size);
uint16_t nrfbhpt_getFromEsc(uint8_t rx_buf[], uint16_t wait_ms);
uint16_t nrfbhpt_sendToEsc(uint8_t tx_buf[], uint16_t buf_size, bool CRC);
uint16_t nrfbhpt_sendToEsc(uint8_t tx_buf[], uint16_t buf_size); // defaults to CRC=true

static uint16_t _byteCrc(uint8_t data, uint16_t crc);
static uint16_t _crc_xmodem_update(uint16_t crc, uint8_t data);

Stream* softSer = NULL;

void nrfbhpt_begin(Stream* ser)
{
    softSer = ser;
}

void nrfbhpt_task(void)
{
    uint32_t avail = Serial.available();
    uint32_t now = millis();
    if (avail != last_avail)
    {
        last_ser_time = now;
        last_avail = avail;
    }

    if ((now - last_ser_time) > 2 && avail > 0)
    {
        serial_command = true;
        while (Serial.available())
        {
            uint8_t c = Serial.read();
            serial_rx[serial_rx_counter] = c;

            if ((serial_rx_counter == 4) && (serial_rx[0] == 0x2F)) {
                // 4 Way Command: Size (0 = 256) + 7 Byte Overhead
                if (serial_rx[4] == 0) {
                    serial_buffer_len = 256 + 7;
                }
                else {
                    serial_buffer_len = serial_rx[4] + 7;
                }
            }
            if ((serial_rx_counter == 3) && (serial_rx[0] == 0x24)) {
                // MSP Command: Size (0 = 0)+ 6 Byte Overhead
                serial_buffer_len = serial_rx[3] + 6;
            }

            serial_rx_counter++;
            if (serial_rx_counter >= serial_buffer_len || serial_rx_counter >= NRFBHPT_SER_BUFF_SIZE) {
                break;
            }
        }
    }

    if (serial_command)
    {
        if ((serial_rx[0] == 0x2F) && (serial_rx_counter >= serial_buffer_len))
        {
            // 4 Way Command
            // 4 Way proceed
            serial_tx_counter = nrfbhpt_4way(serial_rx);
            for (uint16_t b = 0; b < serial_tx_counter; b++) {
                Serial.write(serial_rx[b]);
            }
            serial_command = false;
            serial_rx_counter = 0;
            serial_tx_counter = 0;
        }
        else if (serial_rx[0] == 0x24 && serial_rx[1] == 0x4D && serial_rx[2] == 0x3C)
        {
            // MSP Command
            // MSP Proceed
            serial_tx_counter = MSP_Check(serial_rx, serial_rx_counter);
            //Serial.print("length ");
            //Serial.println(i);
            for (uint8_t b = 0; b < serial_tx_counter; b++) {
                Serial.write(serial_rx[b]);
            }
            serial_command = false;
            serial_rx_counter = 0;
            serial_tx_counter = 0;
        }
    }
}

uint16_t nrfbhpt_4way(uint8_t buf[])
{
    uint8_t cmd = buf[1];
    uint8_t addr_high = buf[2];
    uint8_t addr_low = buf[3];
    uint8_t I_Param_Len = buf[4];
    uint8_t param = buf[5];               // param = ParamBuf[0]
    uint8_t ParamBuf[256] = {0};          // Parameter Buffer
    uint16_t crc = 0;
    uint16_t buf_size;                    // return Output Buffer Size -> O_Param_Len + Header + CRC
    uint8_t ack_out = ACK_OK;
    uint16_t O_Param_Len = 0;

    for (uint8_t i = 0; i < 5 ; i++) {            // CRC Check of Header (CMD, Adress, Size
        crc = _crc_xmodem_update (crc, buf[i]);
    }
    uint8_t InBuff = I_Param_Len;                 // I_Param_Len = 0 -> 256Bytes
    uint16_t i = 0;                               // work counter
    do {                                          // CRC Check of Input Parameter Buffer
        crc = _crc_xmodem_update (crc, buf[i + 5]);
        ParamBuf[i] = buf[i + 5];
        i++;
        InBuff--;
    } while (InBuff != 0);
    uint16_t crc_in = ((buf[i + 5] << 8) | buf[i + 6]);

#ifdef _DEBUG_
    Serial.print("4Way CMD: ");
    Serial.print(cmd, HEX);
    Serial.print(" Adress: ");
    Serial.print(addr_high, HEX);
    Serial.print(addr_low, HEX);
    Serial.print(" ParamBuf Size: ");
    Serial.print(I_Param_Len, HEX);
    // buffer
    Serial.print(" ParamBuf[0]: ");
    Serial.print(ParamBuf[0], HEX);
    // buffer
    Serial.print(" CRC_in: ");
    Serial.print(crc_in, HEX);
    Serial.print(" CRC calculated: ");
    Serial.println(crc, HEX);
#endif

    if (crc_in != crc)
    {
#ifdef _DEBUG_
        Serial.print("Wrong CRC ");
#endif
        buf[0] = cmd_Remote_Escape;
        buf[1] = cmd;
        buf[2] = addr_high;
        buf[3] = addr_low;
        O_Param_Len = 0x01;
        buf[4] = 0x01;        // Output Param Lenght
        buf[5] = 0x00;        // Dummy
        ack_out = ACK_I_INVALID_CRC;
        buf[6] = ACK_I_INVALID_CRC;    // ACK
        for (uint8_t i = 0; i < 7; i++) {
            crc = _crc_xmodem_update (crc, buf[i]);
        }
        buf[7] = (crc >> 8) & 0xff;
        buf[8] = crc & 0xff;
#ifdef _DEBUG_
        Serial.print("with CRC: 0x");
        Serial.print(buf[7], HEX);
        Serial.print(" ");
        Serial.print(buf[8], HEX);
        Serial.print(" ");
#endif
        buf_size = 9;
        if (cmd < 0x50) {
            return buf_size;
        }
    }

    crc = 0;
    ack_out = ACK_OK;
    buf[5] = 0;

    if (cmd == cmd_DeviceInitFlash)
    {
#ifdef _DEBUG_
        Serial.print("DeviceInitFlash ");
#endif
        O_Param_Len = 0x04;
        if (param == 0x00)
        {  // ESC Count
            uint8_t BootInit[] = {0, 0, 0, 0, 0, 0, 0, 0, 0x0D, 'B', 'L', 'H', 'e', 'l', 'i', 0xF4, 0x7D};
            uint8_t Init_Size = 17;
            uint8_t RX_Size = 0;
            uint8_t RX_Buf[250] = {0};
            // DeviceInitFlash hat die CRC bereits im Array enthalten, daher darf keine CRC gesendet werden
            RX_Size = nrfbhpt_sendToEsc(BootInit, Init_Size, false);        // send without CRC
            //RX_Size = nrfbhpt_sendToEsc(BootInit, Init_Size);             // send with CRC
            delay(50);
            // read Answer Format = BootMsg("471c") SIGNATURE_001, SIGNATURE_002, BootVersion, BootPages (,ACK = brSUCCESS = 0x30)
            RX_Size = nrfbhpt_getFromEsc(RX_Buf, 200);
#ifdef _DEBUG_
            Serial.print("ESC Received: ");
            Serial.print(RX_Size);
            Serial.print(" ");
            Serial.print("Bytes: ");
            Serial.print(RX_Buf[0], HEX);
            Serial.print(" ");
            Serial.print(RX_Buf[1], HEX);
            Serial.print(" ");
            Serial.print(RX_Buf[2], HEX);
            Serial.print(" ");
            Serial.print(RX_Buf[3], HEX);
            Serial.print(" ");
            Serial.print(RX_Buf[4], HEX);
            Serial.print(" ");
            Serial.print(RX_Buf[5], HEX);
            Serial.print(" ");
            Serial.print(RX_Buf[6], HEX);
            Serial.print(" ");
            Serial.print(RX_Buf[7], HEX);
            Serial.print(" ");
            Serial.print(RX_Buf[8], HEX);
#endif
            if (RX_Buf[RX_Size - 1] == brSUCCESS) {
                buf[5] = RX_Buf[5];       // Device Signature2?
                buf[6] = RX_Buf[4];       // Device Signature1?
                buf[7] = RX_Buf[3];       // "c"?
                buf[8] = imARM_BLB;       // 4-Way Mode: ARMBLB = 0x04
                buf[9] = ACK_OK;          // ACK
#ifdef _DEBUG_
                Serial.print("OK");
#endif
            }
            else {
                buf[5] = 0x06;        // Device Signature2?
                buf[6] = 0x33;        // Device Signature1?
                buf[7] = 0x67;        // "c"?
                buf[8] = imARM_BLB;   // Boot Pages?
                ack_out = ACK_D_GENERAL_ERROR;
                buf[9] = ACK_D_GENERAL_ERROR;    // ACK
#ifdef _DEBUG_
                Serial.print("General Error");
#endif
            }
        }
        else {
            ack_out = ACK_I_INVALID_CHANNEL;
            buf[9] = ACK_I_INVALID_CHANNEL;    // ACK
#ifdef _DEBUG_
            Serial.print("Invalid channel");
#endif
        }
    }
    else if (cmd == cmd_DeviceReset)
    {
#ifdef _DEBUG_
        Serial.print("DeviceReset ");
#endif
        O_Param_Len = 0x01;
        if ((param == 0x00)/*&& (addr_high == 0x00)*/)
        {
            // ESC Count
            if (enable4way)
            {
                buf[6] = ACK_OK;    // ACK
                uint8_t ESC_data[2] = {RestartBootloader, 0};
                uint16_t Data_Size = 2;
                uint16_t RX_Size = 0;
                RX_Size = nrfbhpt_sendToEsc(ESC_data, Data_Size);
                // Betaflight setzt ausgang Low -> wartet 300ms -> setzt Ausgang High
                digitalWrite(SERVO_OUT, LOW);
                delay(300);
                digitalWrite(SERVO_OUT, HIGH);
                // Keine Antwort vom ESC -> trotzdem serial leeren
                uint8_t RX_Buf[5] = {0};
                RX_Size = nrfbhpt_getFromEsc(RX_Buf, 50);
            }
            else {
                ack_out = ACK_D_GENERAL_ERROR;
                buf[6] = ACK_D_GENERAL_ERROR;
#ifdef _DEBUG_
                Serial.print("4Way not aktive");
#endif
            }
        }
        else
        {
            buf[5] = 0x00;
            ack_out = ACK_I_INVALID_CHANNEL;
            buf[6] = ACK_I_INVALID_CHANNEL;    // ACK
#ifdef _DEBUG_
            Serial.print("Invalid channel");
#endif
        }
    }
    else if (cmd == cmd_InterfaceTestAlive)
    {
#ifdef _DEBUG_
        Serial.print("InterfaceTestAlive ");
#endif
        O_Param_Len = 0x01;
        uint8_t ESC_data[2] = {CMD_KEEP_ALIVE, 0};
        uint16_t Data_Size = 2;
        uint16_t RX_Size = 0;
        uint8_t RX_Buf[250] = {0};
        RX_Size = nrfbhpt_sendToEsc(ESC_data, Data_Size);
        delay(5);
        RX_Size = nrfbhpt_getFromEsc(RX_Buf, 200);
#ifdef _DEBUG_
        Serial.print("ESC Received: ");
        Serial.print(RX_Size);
        Serial.print(" Bytes: ");
        Serial.print(RX_Buf[0], HEX);
#endif
        if (RX_Buf[0] == brSUCCESS) {
            //buf[6] = ACK_OK;    // ACK
        }
        else {
            //buf[6] = ACK_D_GENERAL_ERROR;    // ACK
        }
    }
    else if (cmd == cmd_DeviceRead)
    {
#ifdef _DEBUG_
        Serial.print("DeviceRead @ Adress ");
        Serial.print(addr_high, HEX);
        Serial.println(addr_low, HEX);
#endif
        uint8_t ESC_data[4] = {CMD_SET_ADDRESS, 0x00, addr_high, addr_low};
        uint16_t Data_Size = 4;
        uint16_t RX_Size = 0;
        uint8_t RX_Buf[300] = {0};
        uint16_t esc_rx_crc = 0;
        RX_Size = nrfbhpt_sendToEsc(ESC_data, Data_Size);
        delay(5);
        RX_Size = nrfbhpt_getFromEsc(RX_Buf, 200);
#ifdef _DEBUG_
        Serial.print("Set Adress -> ESC Received: ");
        Serial.print(RX_Size);
        Serial.print(" ACK: ");
        Serial.print(RX_Buf[0], HEX);
#endif

