frank26080115/robots/Roach/libraries/nRF52BlHeliPassthru/nRF52BlHeliPassthru.cpp
        if (RX_Buf[0] == brSUCCESS)
        {
#ifdef _DEBUG_
            Serial.println(" -> Success");
#endif
            // alles ok
            ESC_data[0] = CMD_READ_FLASH_SIL;
            ESC_data[1] = param;
            Data_Size = 2;
            RX_Size = nrfbhpt_sendToEsc(ESC_data, Data_Size);
            if (param == 0) {
                O_Param_Len = 256;
                delay(256);
            }
            else {
                delay(param);
                O_Param_Len = param;
            }
            RX_Size = nrfbhpt_getFromEsc(RX_Buf, 500);
#ifdef _DEBUG_
            Serial.print("Read Flash -> ESC Received: ");
            Serial.print(RX_Size);
            Serial.print(" ACK: ");
            Serial.print(RX_Buf[(RX_Size - 1)], HEX);
#endif
            if (RX_Size != 0)
            {
                if (RX_Buf[(RX_Size - 1)] == brSUCCESS) {
#ifdef _DEBUG_
                    Serial.println(" -> Success");
#endif
                }
                else {
#ifdef _DEBUG_
                    Serial.println(" -> Fail");
#endif
                    ack_out = ACK_D_GENERAL_ERROR;
                }
                RX_Size = RX_Size - 3;                              // CRC High, CRC_Low and ACK from ESC
                O_Param_Len = RX_Size;
                for (uint16_t i = 5; i < (RX_Size + 5); i++) {
                    buf[i] = RX_Buf[i - 5]; // buf[5] = RX_Buf[0]
                    esc_rx_crc = _byteCrc(buf[i], esc_rx_crc);
                    //Data_Size = i;
                }
                esc_rx_crc = _byteCrc(RX_Buf[(RX_Size)], esc_rx_crc);
                esc_rx_crc = _byteCrc(RX_Buf[(RX_Size + 1)], esc_rx_crc);
#ifdef _DEBUG_
                Serial.print("ESC CRC: : ");
                Serial.print(esc_rx_crc, HEX);
#endif
                if (esc_rx_crc == 0) {
#ifdef _DEBUG_
                    Serial.println("-> CRC OK");
#endif
                }
                else {
                    ack_out = ACK_D_GENERAL_ERROR;
                    O_Param_Len = 0x01;
#ifdef _DEBUG_
                    Serial.println("-> CRC Fail");
#endif
                }
            }
            else
            {
#ifdef _DEBUG_
                Serial.println(" -> Fail");
#endif
                ack_out = ACK_D_GENERAL_ERROR;
                O_Param_Len = 0x01;
            }
        }
        else
        {
#ifdef _DEBUG_
            Serial.println(" -> Fail");
#endif
            // nix ok
            O_Param_Len = 0x01;
            ack_out = ACK_D_GENERAL_ERROR;
        }
    }
    else if (cmd == cmd_InterfaceExit)
    {
#ifdef _DEBUG_
        Serial.print("Interface Exit ");
#endif
        DeinitSerialOutput();           // initialisiert PPM IN/OUT
        O_Param_Len = 0x01;
    }
    else if (cmd == cmd_ProtocolGetVersion)
    {
#ifdef _DEBUG_
        Serial.print("ProtocolGetVersion ");
#endif
        O_Param_Len = 0x01;
        buf[5] = SERIAL_4WAY_PROTOCOL_VER;//0x6C;
    }
    else if (cmd == cmd_InterfaceGetName)
    {
#ifdef _DEBUG_
        Serial.print("InterfaceGetName ");
#endif
        // SERIAL_4WAY_INTERFACE_NAME_STR "m4wFCIntf"
        O_Param_Len = 0x09;
        //buf[4] = 0x09;        // Output Param Lenght
        buf[5] = 'm';//0x6D;
        buf[6] = '4';//0x34;
        buf[7] = 'w';//0x77;
        buf[8] = 'F';//0x46;
        buf[9] = 'C';//0x43;
        buf[10] = 'I';//0x49;
        buf[11] = 'n';//0x6E;
        buf[12] = 't';//0x74;
        buf[13] = 'f';//0x66;
    }
    else if (cmd == cmd_InterfaceGetVersion)
    {
#ifdef _DEBUG_
        Serial.print("InterfaceGetVersion ");
#endif
        O_Param_Len = 0x02;
        buf[5] = SERIAL_4WAY_VERSION_HI;//0xC8;
        buf[6] = SERIAL_4WAY_VERSION_LO;//0x04;
    }
    else if (cmd == cmd_InterfaceSetMode)
    {
#ifdef _DEBUG_
        Serial.print("InterfaceSetMode ");
#endif
        O_Param_Len = 0x01;
        if (param == imARM_BLB) {
            //buf[6] = ACK_OK;      // ACK
        }
        else {
            buf[6] = ACK_I_INVALID_PARAM;      // ACK
            ack_out = ACK_I_INVALID_PARAM;
        }
    }
    else if (cmd == cmd_DeviceVerify)
    {
#ifdef _DEBUG_
        Serial.print("DeviceVerify ");
#endif
        O_Param_Len = 0x01;
    }
    else if (cmd == cmd_DevicePageErase)
    {
#ifdef _DEBUG_
        Serial.print("DevicePageErase ");
#endif
        O_Param_Len = 0x01;
        addr_high = (param << 2);
        addr_low = 0;
        // Send CMD Adress
        uint8_t ESC_data[4] = {CMD_SET_ADDRESS, 0, addr_high, addr_low};
        uint16_t Data_Size = 4;
        uint16_t RX_Size = 0;
        uint8_t RX_Buf[250] = {0};
        RX_Size = nrfbhpt_sendToEsc(ESC_data, Data_Size);
        delay(5);
        RX_Size = nrfbhpt_getFromEsc(RX_Buf, 200);
#ifdef _DEBUG_
        Serial.print("ESC Received: ");
        Serial.print(RX_Size);
        Serial.print(" Bytes: ");
        Serial.print(RX_Buf[0], HEX);
#endif
        if (RX_Buf[0] == brSUCCESS) {
            //buf[6] = ACK_OK;    // ACK
        }
        else {
            ack_out = ACK_D_GENERAL_ERROR;
            buf[6] = ACK_D_GENERAL_ERROR;    // ACK
        }
        // Send Data
        ESC_data[0] = CMD_ERASE_FLASH;
        ESC_data[1] = 0x01;
        Data_Size = 2;
        RX_Size = 0;
        RX_Size = nrfbhpt_sendToEsc(ESC_data, Data_Size);
        delay(50);
        RX_Size = nrfbhpt_getFromEsc(RX_Buf, 100);
#ifdef _DEBUG_
        Serial.print("ESC Received: ");
        Serial.print(RX_Size);
        Serial.print(" Bytes: ");
        Serial.print(RX_Buf[0], HEX);
#endif
        if (RX_Buf[0] == brSUCCESS) {
            //buf[6] = ACK_OK;    // ACK
        }
        else {
            ack_out = ACK_D_GENERAL_ERROR;
            buf[6] = ACK_D_GENERAL_ERROR;    // ACK
        }
    }
    else if (cmd == cmd_DeviceWrite)
    {
#ifdef _DEBUG_
        Serial.print("DeviceWrite ");
#endif
        O_Param_Len = 0x01;
        // Send CMD Adress
        uint8_t ESC_data[4] = {CMD_SET_ADDRESS, 0, addr_high, addr_low};
        uint16_t Data_Size = 4;
        uint16_t RX_Size = 0;
        uint8_t RX_Buf[250] = {0};
        RX_Size = nrfbhpt_sendToEsc(ESC_data, Data_Size);
        delay(50);
        RX_Size = nrfbhpt_getFromEsc(RX_Buf, 100);
#ifdef _DEBUG_
        Serial.print("ESC Received: ");
        Serial.print(RX_Size);
        Serial.print(" Bytes: ");
        Serial.print(RX_Buf[0], HEX);
#endif
        if (RX_Buf[0] == brSUCCESS) {

