frank26080115/robots/Roach/libraries/nRF52BlHeliPassthru/nRF52BlHeliPassthru.cpp
    crc = MSP_buf[3] ^ MSP_buf[4];
    for(uint8_t i = 5; i < MSP_OSize;i++) {
       crc = crc ^ MSP_buf[i];
    }
    MSP_buf[MSP_OSize]= crc;
#ifdef _DEBUG_
    Serial.print("with CRC: 0x");
    Serial.print(crc,HEX);
    Serial.print(" ");
#endif
    buf_size = MSP_OSize + 1;

    return buf_size;
}

uint16_t nrfbhpt_sendToEsc(uint8_t tx_buf[], uint16_t buf_size)
{
    return nrfbhpt_sendToEsc(tx_buf, buf_size, true); // defaults to CRC=true
}

uint16_t nrfbhpt_sendToEsc(uint8_t tx_buf[], uint16_t buf_size, bool CRC)
{
    uint16_t i = 0;
    uint16_t send_size = buf_size + (CRC ? 2 : 0);

    uint8_t* tmp_buf = (uint8_t*)malloc(send_size);
    if (tmp_buf == NULL) {
        return 0;
    }

    esc_crc = 0;
    if (buf_size == 0) {
        buf_size = 256;
    }
#ifdef _DEBUG_
    Serial.print("write ESC: ");
#endif
    //softSer->enableTx(true);
    for (i = 0; i < buf_size; i++)
    {
        uint8_t x = tx_buf[i];
        //softSer->write(x);
        tmp_buf[i] = x;
        esc_crc = _byteCrc(x, esc_crc);
    }
    if (CRC)
    {
        //softSer->write(esc_crc & 0xff);
        //softSer->write((esc_crc >> 8) & 0xff);
        tmp_buf[i] = esc_crc & 0xff;
        i++;
        tmp_buf[i] = (esc_crc >> 8) & 0xff;
        i++;
    }
    //softSer->enableTx(false);
    softSer->write((const uint8_t*)tmp_buf, i);
#ifdef _DEBUG_
    Serial.println("done");
#endif

    free(tmp_buf);

    return 0;
}

uint16_t nrfbhpt_getFromEsc(uint8_t rx_buf[], uint16_t wait_ms)
{
    uint32_t now = millis();
    uint32_t t_start = now;
    uint16_t i = 0;
    esc_crc = 0;
    bool timeout = false;
#ifdef _DEBUG_
    Serial.print("ESC Read: ");
#endif
    while (softSer->available() <= 0 && ((now = millis()) - t_start) < wait_ms)
    {
        yield();
    }
    if (softSer->available() <= 0) {
#ifdef _DEBUG_
        Serial.println("timeout");
#endif
        return 0;
    }
    i = 0;
    t_start = millis();
    while (true)
    {
        while (softSer->available() > 0)
        {
            rx_buf[i] = softSer->read();
#ifdef _DEBUG_
            Serial.print(rx_buf[i], HEX);
            Serial.print(" ");
#endif
            i++;
            t_start = millis();
        }
        yield();
        if ((millis() - t_start) > 2) {
            break;
        }
    }

#ifdef _DEBUG_
    Serial.println("done");
#endif
    return i;
}

static uint16_t _byteCrc(uint8_t data, uint16_t crc)
{
    uint8_t xb = data;
    for (uint8_t i = 0; i < 8; i++)
    {
        if (((xb & 0x01) ^ (crc & 0x0001)) != 0 ) {
            crc = crc >> 1;
            crc = crc ^ 0xA001;
        } else {
            crc = crc >> 1;
        }
        xb = xb >> 1;
    }
    return crc;
}

static uint16_t _crc_xmodem_update(uint16_t crc, uint8_t data)
{
    int i;

    crc = crc ^ ((uint16_t)data << 8);
    for (i = 0; i < 8; i++)
    {
        if (crc & 0x8000) {
            crc = (crc << 1) ^ 0x1021;
        }
        else {
            crc <<= 1;
        }
    }
    return crc;
}
